export function getRandomPercentage(max) {
    let num = Math.floor(Math.random() * max);
    return num/100.0;
}

export function getDataForIdentification(){
    let data = [
        {
            risk : 'Функціональні характеристики ПЗ',
            value: 1
        },
        {
            risk : 'Характеристики якості ПЗ',
            value: 1
        },
        {
            risk : 'Характеристики надійності ПЗ',
            value: 1
        },
        {
            risk : 'Застосовність ПЗ',
            value: 1
        },
        {
            risk : 'Часова продуктивність ПЗ',
            value: 1
        },
        {
            risk : 'Супроводжуваність ПЗ',
            value: 1
        },
        {
            risk : 'Повторне використання компонент ПЗ',
            value: 1
        },
        {
            risk : 'Обмеження сумарного бюджету на програмний проект',
            value: 1
        },
        {
            risk : 'Недоступна вартість реалізації програмного проекту',
            value: 1
        },
        {
            risk : 'Низька ступінь реалізму при оцінюванні витрат на програмний проект',
            value: 1
        },
        {
            risk : 'Низька ступінь реалізму при встановленні планів і етапів життєвого циклу розроблення ПЗ',
            value: 1
        },
        {
            risk : 'Можливості порушення встановлених термінів реалізації етапів життєвого циклу розроблення ПЗ',
            value: 1
        },
        {
            risk : 'Властивості та можливості гнучкості внесення змін до планів життєвого циклу розроблення ПЗ',
            value: 1
        },
        {
            risk : 'Хибна стратегія реалізації програмного проекту',
            value: 1
        },
        {
            risk : 'Неефективне планування проекту розроблення ПЗ',
            value: 1
        },
        {
            risk : 'Неякісне оцінювання програмного проекту',
            value: 1
        },            {
            risk : 'Прогалини в документуванні етапів реалізації програмного проекту',
            value: 1
        },            {
            risk : 'Промахи в прогнозуванні результатів реалізації програмного проекту',
            value: 1
        }
    ];

    return data;
}

export function getDataForIdentificationAction(){
    return [
        {
            value: 1,
            num : 't1',
            solution: 'попередні дослідження ринку;попереднє навчання членів проектного колективу;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ'
        },
        {
            value: 1,
            num : 't2',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ'
        },
        {
            value: 1,
            num : 't3',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'небажання команди виконавців ПЗ використовувати інструментальні засоби для підтримки процесу розроблення ПЗ'
        },
        {
            value: 1,
            num : 't4',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'відмова команди виконавців від CASE-засобів розроблення ПЗ'
        },
        {
            value: 1,
            num : 't5',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'формування запитів на більш потужні інструментальні засоби розроблення ПЗ'
        },
        {
            value: 1,
            num : 't6',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ'
        },
        {
            value: 1,
            num : 't7',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості'
        },
        {
            value: 1,
            num : 't8',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ'
        },
        {
            value: 1,
            num : 't9',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ'
        },
        {
            value: 1,
            num : 't10',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів'
        },
        {
            value: 1,
            num : 't11',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'поява дефектних системних компонент, які використовують для розроблення ПЗ'
        },
        {
            value: 1,
            num : 'c1',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'недооцінювання витрат на реалізацію програмного проекту'
        },
        {
            value: 1,
            num : 'c2',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'переоцінювання витрат на реалізацію програмного проекту'
        },
        {
            value: 1,
            num : 'c3',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'фінансові ускладнення у компанії-замовника ПЗ'
        },
        {
            value: 1,
            num : 'c4',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'фінансові ускладнення у компанії-розробника ПЗ'
        },
        {
            value: 1,
            num : 'c5',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації'
        },
        {
            value: 1,
            num : 'c6',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації'
        },
        {
            value: 1,
            num : 'c7',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ'
        },
        {
            value: 1,
            num : 'c8',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'реорганізація структурних підрозділів у компанії-замовника ПЗ'
        },
        {
            value: 1,
            num : 'c9',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'реорганізація команди виконавців у компанії-розробника ПЗ'
        },
        {
            value: 1,
            num : 'p1',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'зміни графіка виконання робіт з боку замовника чи виконавця'
        },
        {
            value: 1,
            num : 'p2',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'порушення графіка виконання робіт у компанії-розробника ПЗ'
        },
        {
            value: 1,
            num : 'p3',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ'
        },
        {
            value: 1,
            num : 'p4',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ'
        },
        {
            value: 1,
            num : 'p5',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ'
        },
        {
            value: 1,
            num : 'p6',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ'
        },
        {
            value: 1,
            num : 'p7',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'переоцінювання тривалості етапів реалізації програмного проекту'
        },
        {
            value: 1,
            num : 'p8',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'остаточний розмір ПЗ перевищує заплановані його характеристики'
        },
        {
            value: 1,
            num : 'p9',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'остаточний розмір ПЗ значно менший за планові його характеристики'
        },
        {
            value: 1,
            num : 'p10',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'поява на ринку аналогічного ПЗ до виходу замовленого'
        },
        {
            value: 1,
            num : 'p11',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'поява на ринку більш конкурентоздатного ПЗ'
        },
        {
            value: 1,
            num : 'm1',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'низький моральний стан персоналу команди виконавців ПЗ'
        },
        {
            value: 1,
            num : 'm2',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'низька взаємодія між членами команди виконавців ПЗ'
        },
        {
            value: 1,
            num : 'm3',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'пасивність керівника (менеджера) програмного проекту'
        },
        {
            value: 1,
            num : 'm4',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'недостатня компетентність керівника (менеджера) програмного проекту'
        },
        {
            value: 1,
            num : 'm5',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'незадоволеність замовника результатами етапів реалізації програмного проекту'
        },
        {
            value: 1,
            num : 'm6',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем'
        },
        {
            value: 1,
            num : 'm7',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'хвороба провідного виконавця в найкритичніший момент розроблення ПЗ'
        },
        {
            value: 1,
            num : 'm8',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'одночасна хвороба декількох виконавців підчас розроблення ПЗ'
        },
        {
            value: 1,
            num : 'm9',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'неможливість організації необхідного навчання персоналу команди виконавців ПЗ'
        },
        {
            value: 1,
            num : 'm10',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'зміна пріоритетів у процесі управління програмним проектом'
        },
        {
            value: 1,
            num : 'm11',
            solution: 'узгодження детального переліку вимог до ПЗ із замовником;придбання (замовлення) частини компонент розроблюваного ПЗ;',
            action: 'недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ'
        },
        {
            value: 1,
            num : 'm12',
            solution: 'підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;консультації досвідченого стороннього консультанта;внесення узгодженого переліку вимог до ПЗ замовника в договір;',
            action: 'переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ'
        },
        {
            value: 1,
            num : 'm13',
            solution: 'попереднє навчання членів проектного колективу;консультації досвідченого стороннього консультанта;підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника;',
            action: 'надмірне документування результатів на етапах реалізації програмного проекту'
        },
        {
            value: 1,
            num : 'm14',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;укладання договору страхування;реорганізація роботи проектного колективу так, щоб обовязки та робота членівколективу перекривали один одного;',
            action: 'недостатнє документування результатів на етапах реалізації програмного проекту'
        },
        {
            value: 1,
            num : 'm15',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'нереалістичне прогнозування результатів на етапах реалізації програмного проекту'
        },
        {
            value: 1,
            num : 'm16',
            solution: 'придбання (замовлення) частини компонент розроблюваного ПЗ;консультації досвідченого стороннього консультанта;тренінг з вивчення необхідних інструментів розроблення ПЗ;експертна оцінка програмного проекту досвідченим стороннім консультантом;',
            action: 'недостатній професійний рівень представників від компанії-замовника ПЗ'
        }
    ];
}